{
  "activation_dropout": 0.0,
  "activation_function": "relu",
  "architectures": [
    "DetrForSegmentation"
  ],
  "attention_dropout": 0.0,
  "auxiliary_loss": false,
  "backbone": "resnet50",
  "bbox_cost": 5,
  "bbox_loss_coefficient": 5,
  "class_cost": 1,
  "classifier_dropout": 0.0,
  "d_model": 256,
  "decoder_attention_heads": 8,
  "decoder_ffn_dim": 2048,
  "decoder_layerdrop": 0.0,
  "decoder_layers": 6,
  "dice_loss_coefficient": 1,
  "dilation": false,
  "dropout": 0.1,
  "encoder_attention_heads": 8,
  "encoder_ffn_dim": 2048,
  "encoder_layerdrop": 0.0,
  "encoder_layers": 6,
  "eos_coefficient": 0.1,
  "giou_cost": 2,
  "giou_loss_coefficient": 2,
  "id2label": {
    "0": "N/A",
    "1": "person",
    "10": "traffic light",
    "100": "cardboard",
    "101": "carpet",
    "102": "ceiling-other",
    "103": "ceiling-tile",
    "104": "cloth",
    "105": "clothes",
    "106": "clouds",
    "107": "counter",
    "108": "cupboard",
    "109": "curtain",
    "11": "fire hydrant",
    "110": "desk-stuff",
    "111": "dirt",
    "112": "door-stuff",
    "113": "fence",
    "114": "floor-marble",
    "115": "floor-other",
    "116": "floor-stone",
    "117": "floor-tile",
    "118": "floor-wood",
    "119": "flower",
    "12": "street sign",
    "120": "fog",
    "121": "food-other",
    "122": "fruit",
    "123": "furniture-other",
    "124": "grass",
    "125": "gravel",
    "126": "ground-other",
    "127": "hill",
    "128": "house",
    "129": "leaves",
    "13": "stop sign",
    "130": "light",
    "131": "mat",
    "132": "metal",
    "133": "mirror-stuff",
    "134": "moss",
    "135": "mountain",
    "136": "mud",
    "137": "napkin",
    "138": "net",
    "139": "paper",
    "14": "parking meter",
    "140": "pavement",
    "141": "pillow",
    "142": "plant-other",
    "143": "plastic",
    "144": "platform",
    "145": "playingfield",
    "146": "railing",
    "147": "railroad",
    "148": "river",
    "149": "road",
    "15": "bench",
    "150": "rock",
    "151": "roof",
    "152": "rug",
    "153": "salad",
    "154": "sand",
    "155": "sea",
    "156": "shelf",
    "157": "sky-other",
    "158": "skyscraper",
    "159": "snow",
    "16": "bird",
    "160": "solid-other",
    "161": "stairs",
    "162": "stone",
    "163": "straw",
    "164": "structural-other",
    "165": "table",
    "166": "tent",
    "167": "textile-other",
    "168": "towel",
    "169": "tree",
    "17": "cat",
    "170": "vegetable",
    "171": "wall-brick",
    "172": "wall-concrete",
    "173": "wall-other",
    "174": "wall-panel",
    "175": "wall-stone",
    "176": "wall-tile",
    "177": "wall-wood",
    "178": "water-other",
    "179": "waterdrops",
    "18": "dog",
    "180": "window-blind",
    "181": "window-other",
    "182": "wood",
    "183": "LABEL_183",
    "184": "LABEL_184",
    "185": "LABEL_185",
    "186": "LABEL_186",
    "187": "LABEL_187",
    "188": "LABEL_188",
    "189": "LABEL_189",
    "19": "horse",
    "190": "LABEL_190",
    "191": "LABEL_191",
    "192": "LABEL_192",
    "193": "LABEL_193",
    "194": "LABEL_194",
    "195": "LABEL_195",
    "196": "LABEL_196",
    "197": "LABEL_197",
    "198": "LABEL_198",
    "199": "LABEL_199",
    "2": "bicycle",
    "20": "sheep",
    "200": "LABEL_200",
    "201": "LABEL_201",
    "202": "LABEL_202",
    "203": "LABEL_203",
    "204": "LABEL_204",
    "205": "LABEL_205",
    "206": "LABEL_206",
    "207": "LABEL_207",
    "208": "LABEL_208",
    "209": "LABEL_209",
    "21": "cow",
    "210": "LABEL_210",
    "211": "LABEL_211",
    "212": "LABEL_212",
    "213": "LABEL_213",
    "214": "LABEL_214",
    "215": "LABEL_215",
    "216": "LABEL_216",
    "217": "LABEL_217",
    "218": "LABEL_218",
    "219": "LABEL_219",
    "22": "elephant",
    "220": "LABEL_220",
    "221": "LABEL_221",
    "222": "LABEL_222",
    "223": "LABEL_223",
    "224": "LABEL_224",
    "225": "LABEL_225",
    "226": "LABEL_226",
    "227": "LABEL_227",
    "228": "LABEL_228",
    "229": "LABEL_229",
    "23": "bear",
    "230": "LABEL_230",
    "231": "LABEL_231",
    "232": "LABEL_232",
    "233": "LABEL_233",
    "234": "LABEL_234",
    "235": "LABEL_235",
    "236": "LABEL_236",
    "237": "LABEL_237",
    "238": "LABEL_238",
    "239": "LABEL_239",
    "24": "zebra",
    "240": "LABEL_240",
    "241": "LABEL_241",
    "242": "LABEL_242",
    "243": "LABEL_243",
    "244": "LABEL_244",
    "245": "LABEL_245",
    "246": "LABEL_246",
    "247": "LABEL_247",
    "248": "LABEL_248",
    "249": "LABEL_249",
    "25": "giraffe",
    "26": "hat",
    "27": "backpack",
    "28": "umbrella",
    "29": "shoe",
    "3": "car",
    "30": "eye glasses",
    "31": "handbag",
    "32": "tie",
    "33": "suitcase",
    "34": "frisbee",
    "35": "skis",
    "36": "snowboard",
    "37": "sports ball",
    "38": "kite",
    "39": "baseball bat",
    "4": "motorcycle",
    "40": "baseball glove",
    "41": "skateboard",
    "42": "surfboard",
    "43": "tennis racket",
    "44": "bottle",
    "45": "plate",
    "46": "wine glass",
    "47": "cup",
    "48": "fork",
    "49": "knife",
    "5": "airplane",
    "50": "spoon",
    "51": "bowl",
    "52": "banana",
    "53": "apple",
    "54": "sandwich",
    "55": "orange",
    "56": "broccoli",
    "57": "carrot",
    "58": "hot dog",
    "59": "pizza",
    "6": "bus",
    "60": "donut",
    "61": "cake",
    "62": "chair",
    "63": "couch",
    "64": "potted plant",
    "65": "bed",
    "66": "mirror",
    "67": "dining table",
    "68": "window",
    "69": "desk",
    "7": "train",
    "70": "toilet",
    "71": "door",
    "72": "tv",
    "73": "laptop",
    "74": "mouse",
    "75": "remote",
    "76": "keyboard",
    "77": "cell phone",
    "78": "microwave",
    "79": "oven",
    "8": "truck",
    "80": "toaster",
    "81": "sink",
    "82": "refrigerator",
    "83": "blender",
    "84": "book",
    "85": "clock",
    "86": "vase",
    "87": "scissors",
    "88": "teddy bear",
    "89": "hair drier",
    "9": "boat",
    "90": "toothbrush",
    "91": "hair brush",
    "92": "banner",
    "93": "blanket",
    "94": "branch",
    "95": "bridge",
    "96": "building-other",
    "97": "bush",
    "98": "cabinet",
    "99": "cage"
   },
  "init_std": 0.02,
  "init_xavier_std": 1.0,
  "is_encoder_decoder": true,
  "label2id": {
    "LABEL_183": 183,
    "LABEL_184": 184,
    "LABEL_185": 185,
    "LABEL_186": 186,
    "LABEL_187": 187,
    "LABEL_188": 188,
    "LABEL_189": 189,
    "LABEL_190": 190,
    "LABEL_191": 191,
    "LABEL_192": 192,
    "LABEL_193": 193,
    "LABEL_194": 194,
    "LABEL_195": 195,
    "LABEL_196": 196,
    "LABEL_197": 197,
    "LABEL_198": 198,
    "LABEL_199": 199,
    "LABEL_200": 200,
    "LABEL_201": 201,
    "LABEL_202": 202,
    "LABEL_203": 203,
    "LABEL_204": 204,
    "LABEL_205": 205,
    "LABEL_206": 206,
    "LABEL_207": 207,
    "LABEL_208": 208,
    "LABEL_209": 209,
    "LABEL_210": 210,
    "LABEL_211": 211,
    "LABEL_212": 212,
    "LABEL_213": 213,
    "LABEL_214": 214,
    "LABEL_215": 215,
    "LABEL_216": 216,
    "LABEL_217": 217,
    "LABEL_218": 218,
    "LABEL_219": 219,
    "LABEL_220": 220,
    "LABEL_221": 221,
    "LABEL_222": 222,
    "LABEL_223": 223,
    "LABEL_224": 224,
    "LABEL_225": 225,
    "LABEL_226": 226,
    "LABEL_227": 227,
    "LABEL_228": 228,
    "LABEL_229": 229,
    "LABEL_230": 230,
    "LABEL_231": 231,
    "LABEL_232": 232,
    "LABEL_233": 233,
    "LABEL_234": 234,
    "LABEL_235": 235,
    "LABEL_236": 236,
    "LABEL_237": 237,
    "LABEL_238": 238,
    "LABEL_239": 239,
    "LABEL_240": 240,
    "LABEL_241": 241,
    "LABEL_242": 242,
    "LABEL_243": 243,
    "LABEL_244": 244,
    "LABEL_245": 245,
    "LABEL_246": 246,
    "LABEL_247": 247,
    "LABEL_248": 248,
    "LABEL_249": 249,
    "N/A": 0,
    "airplane": 5,
    "apple": 53,
    "backpack": 27,
    "banana": 52,
    "banner": 92,
    "baseball bat": 39,
    "baseball glove": 40,
    "bear": 23,
    "bed": 65,
    "bench": 15,
    "bicycle": 2,
    "bird": 16,
    "blanket": 93,
    "blender": 83,
    "boat": 9,
    "book": 84,
    "bottle": 44,
    "bowl": 51,
    "branch": 94,
    "bridge": 95,
    "broccoli": 56,
    "building-other": 96,
    "bus": 6,
    "bush": 97,
    "cabinet": 98,
    "cage": 99,
    "cake": 61,
    "car": 3,
    "cardboard": 100,
    "carpet": 101,
    "carrot": 57,
    "cat": 17,
    "ceiling-other": 102,
    "ceiling-tile": 103,
    "cell phone": 77,
    "chair": 62,
    "clock": 85,
    "cloth": 104,
    "clothes": 105,
    "clouds": 106,
    "couch": 63,
    "counter": 107,
    "cow": 21,
    "cup": 47,
    "cupboard": 108,
    "curtain": 109,
    "desk": 69,
    "desk-stuff": 110,
    "dining table": 67,
    "dirt": 111,
    "dog": 18,
    "donut": 60,
    "door": 71,
    "door-stuff": 112,
    "elephant": 22,
    "eye glasses": 30,
    "fence": 113,
    "fire hydrant": 11,
    "floor-marble": 114,
    "floor-other": 115,
    "floor-stone": 116,
    "floor-tile": 117,
    "floor-wood": 118,
    "flower": 119,
    "fog": 120,
    "food-other": 121,
    "fork": 48,
    "frisbee": 34,
    "fruit": 122,
    "furniture-other": 123,
    "giraffe": 25,
    "grass": 124,
    "gravel": 125,
    "ground-other": 126,
    "hair brush": 91,
    "hair drier": 89,
    "handbag": 31,
    "hat": 26,
    "hill": 127,
    "horse": 19,
    "hot dog": 58,
    "house": 128,
    "keyboard": 76,
    "kite": 38,
    "knife": 49,
    "laptop": 73,
    "leaves": 129,
    "light": 130,
    "mat": 131,
    "metal": 132,
    "microwave": 78,
    "mirror": 66,
    "mirror-stuff": 133,
    "moss": 134,
    "motorcycle": 4,
    "mountain": 135,
    "mouse": 74,
    "mud": 136,
    "napkin": 137,
    "net": 138,
    "orange": 55,
    "oven": 79,
    "paper": 139,
    "parking meter": 14,
    "pavement": 140,
    "person": 1,
    "pillow": 141,
    "pizza": 59,
    "plant-other": 142,
    "plastic": 143,
    "plate": 45,
    "platform": 144,
    "playingfield": 145,
    "potted plant": 64,
    "railing": 146,
    "railroad": 147,
    "refrigerator": 82,
    "remote": 75,
    "river": 148,
    "road": 149,
    "rock": 150,
    "roof": 151,
    "rug": 152,
    "salad": 153,
    "sand": 154,
    "sandwich": 54,
    "scissors": 87,
    "sea": 155,
    "sheep": 20,
    "shelf": 156,
    "shoe": 29,
    "sink": 81,
    "skateboard": 41,
    "skis": 35,
    "sky-other": 157,
    "skyscraper": 158,
    "snow": 159,
    "snowboard": 36,
    "solid-other": 160,
    "spoon": 50,
    "sports ball": 37,
    "stairs": 161,
    "stone": 162,
    "stop sign": 13,
    "straw": 163,
    "street sign": 12,
    "structural-other": 164,
    "suitcase": 33,
    "surfboard": 42,
    "table": 165,
    "teddy bear": 88,
    "tennis racket": 43,
    "tent": 166,
    "textile-other": 167,
    "tie": 32,
    "toaster": 80,
    "toilet": 70,
    "toothbrush": 90,
    "towel": 168,
    "traffic light": 10,
    "train": 7,
    "tree": 169,
    "truck": 8,
    "tv": 72,
    "umbrella": 28,
    "vase": 86,
    "vegetable": 170,
    "wall-brick": 171,
    "wall-concrete": 172,
    "wall-other": 173,
    "wall-panel": 174,
    "wall-stone": 175,
    "wall-tile": 176,
    "wall-wood": 177,
    "water-other": 178,
    "waterdrops": 179,
    "window": 68,
    "window-blind": 180,
    "window-other": 181,
    "wine glass": 46,
    "wood": 182,
    "zebra": 24
   },
  "mask_loss_coefficient": 1,
  "max_position_embeddings": 1024,
  "model_type": "detr",
  "num_hidden_layers": 6,
  "num_queries": 100,
  "position_embedding_type": "sine",
  "scale_embedding": false,
  "transformers_version": "4.7.0.dev0"
}
